Tekla Open API Reference for Tekla Structures 2025
RebarItem.CrankedLengthType Property
 Gets or sets the cranked length type.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string CrankedLengthType { get; set; }
Public Property CrankedLengthType As String
	Get
	Set
Property Value
Type: String
See Also
Reference
RebarItem Class
Tekla.Structures.Catalogs Namespace